//package homework_27.marathon.Pets_marathon;
//
//import homework_27.marathon.Pets_marathon.model.Cat;
//import homework_27.marathon.Pets_marathon.model.Dog;
//
////Создайте HouseAppl, в котором есть метод main. Поселите в доме 2 собаки и 3 кошки. Смоделируйте жизнь в этом доме в течение дня.
//public class HouseAppl {
//    public static void main(String[] args) {
//        Dog dog = new Dog(1, "псовые", 20, "Пёс", "отсутствует", 40, 23);
//        Dog dog2 = new Dog(2, "псовые", 5, "Рэкс", "Немецкая овчарка", 65, 40);
//        Cat cat = new Cat(3, "кошачьи", 2, "Соломон", "Сиамская", 30, 6);
//        Cat cat1 = new Cat(4, "кошачьи", 3, "Рыжик", "Сибирская", 37, 9);
//        Cat cat2 = new Cat(5, "кошачьи", 2, "Барсик", "Мейн-кун", 41, 14);
//        System.out.println("В доме проживают: ");
//        System.out.println(dog.toString());
//        System.out.println(dog2.toString());
//        System.out.println(cat.toString());
//        System.out.println(cat1.toString());
//        System.out.println(cat2.toString());
//
//   dog.voice();
//   cat.voice();
//   dog2.voice();
//   cat1.voice();
//   cat2.voice();
//
//        System.out.println("Собаки гавкают, кошки мяукают, каждый занят своим делом.");
//    }//end of main
//
//
//}//end of class
